
#include <intrins.h>
#include "stc8.h"


extern unsigned char SELF_TEST_ZOOM_FLAG;
extern unsigned char SELF_TEST_FOCUS_FLAG;
extern unsigned char CNT_FLAG;

/****************************************************************************
* 名		称: void Timer0Init(void)	
* 功		能: 定时器0初始化 使用内部24MHz时钟
* 入口参数: 无
* 出口参数: 无
* 说		明:
* 调用方法:
****************************************************************************/
void Timer0Init(void)		//1??@24.000MHz
{
	AUXR &= 0x7F;		//?????12T??
	TMOD &= 0xF0;		//???????
	TL0 = 0x30;		//设置定时器初值
	TH0 = 0xF8;		//设置定时器初值
	TF0 = 0;		//清除TF0标志
	TR0 = 1;		//定时器0开始计时
	
	ET0 = 1;    //使能定时器中断
	EA = 1;
}



/****************************************************************************
* 名		称: void TM0_Isr() interrupt 1 using 1
* 功		能: 定时器0中断函数 间隔时间1ms
* 入口参数: 无
* 出口参数: 无
* 说		明:
* 调用方法:
****************************************************************************/
void TM0_Isr() interrupt 1 using 1
{

}



/****************************************************************************
* 名		称: void Timer4Init(void)	
* 功		能: 定时器4初始化 使用内部24MHz时钟
* 入口参数: 无
* 出口参数: 无
* 说		明:
* 调用方法:
****************************************************************************/
void Timer4Init(void)		//1??@24.000MHz
{//0x30fb == 1111 1000 0011 0000 == 63536
	T4L = 0x30;		//设置定时器初值  65536-24M/12/1000 == 63536
	T4H = 0xf8;		//设置定时器初值  当T4H,T4L中的是6位计数值溢出时,系统将内部16位重载值装入T4H,T4L;
	T4T3M = 0x80;	//定时器4开始计数															
	IE2 = ET4;		//允许T4（计算器溢出）中断
	EA = 1;				//CPU开放中断
}



/****************************************************************************
* 名		称: void TM4_Isr() interrupt 20 using 1
* 功		能: 定时器4中断函数 间隔时间1ms
* 入口参数: 无
* 出口参数: 无
* 说		明:
* 调用方法:
****************************************************************************/
void TM4_Isr() interrupt 20 using 1
{
	 // P03 = !P03;
	  SELF_TEST_ZOOM_FLAG = !SELF_TEST_ZOOM_FLAG;
	  SELF_TEST_FOCUS_FLAG = !SELF_TEST_FOCUS_FLAG;
	  CNT_FLAG = 1;
    AUXINTIF &= ~T4IF;                          //清中断标志
}


/****************************************************************************
* 名		称: void StopTime(void)
* 功		能: 停止定时器
* 入口参数: 无
* 出口参数: 无
* 说		明:
* 调用方法:
****************************************************************************/
void StopTime(void)
{
		T4T3M = 0x00; //停止定时器4
}



/****************************************************************************
* 名		称: void StartTime(void)
* 功		能: 停止定时器
* 入口参数: 无
* 出口参数: 无
* 说		明:
* 调用方法:
****************************************************************************/
void StartTime(void)
{
		T4T3M = 0x80; //启动定时器4
		IE2 = ET4;
}







